/******************************************************************************/
/* ファイル名 : me6eapp_mainloop.h                                            */
/* 機能概要   : メインループ関数 ヘッダファイル                               */
/* 修正履歴   : 2013.01.24 Y.Shibata 新規作成                                 */
/*            : 2016.04.15 H.Koganemaru 名称変更に伴う修正                    */
/*                                                                            */
/* ALL RIGHTS RESERVED, COPYRIGHT(C) FUJITSU LIMITED 2013-2016                */
/******************************************************************************/
#ifndef __ME6EAPP_MAINLOOP_H__
#define __ME6EAPP_MAINLOOP_H__

#include "me6eapp.h"

////////////////////////////////////////////////////////////////////////////////
// 外部関数プロトタイプ宣言
////////////////////////////////////////////////////////////////////////////////
int me6e_mainloop(struct me6e_handler_t* handler);

#endif // __ME6EAPP_MAINLOOP_H__

